{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "keras_layer_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/efficientnet/lite0/feature-vector/2", "output_shape": [1280], "signature": "default", "output_key": "default"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "dense/kernel", "shape": [1280, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 5], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32"}, {"name": "efficientnet-lite0/stem/conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "efficientnet-lite0/stem/tpu_batch_normalization/gamma", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/stem/tpu_batch_normalization/beta", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/stem/tpu_batch_normalization/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/stem/tpu_batch_normalization/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization/gamma", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization/beta", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/conv2d/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_0/tpu_batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/conv2d/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization/gamma", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization/beta", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_1/gamma", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_1/beta", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_1/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_1/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/conv2d_1/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_2/gamma", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_2/beta", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_2/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_1/tpu_batch_normalization_2/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/conv2d/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization/gamma", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization/beta", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_1/beta", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/conv2d_1/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_2/gamma", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_2/beta", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_2/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_2/tpu_batch_normalization_2/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/conv2d/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization/gamma", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization/beta", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 144, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_1/beta", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/conv2d_1/kernel", "shape": [1, 1, 144, 40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_2/gamma", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_2/beta", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_2/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_3/tpu_batch_normalization_2/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/conv2d/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization/gamma", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization/beta", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 240, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_1/beta", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/conv2d_1/kernel", "shape": [1, 1, 240, 40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_2/gamma", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_2/beta", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_2/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_4/tpu_batch_normalization_2/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/conv2d/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization/gamma", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization/beta", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 240, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_1/beta", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/conv2d_1/kernel", "shape": [1, 1, 240, 80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_2/gamma", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_2/beta", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_2/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_5/tpu_batch_normalization_2/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/conv2d/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization/gamma", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization/beta", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_1/beta", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/conv2d_1/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_2/gamma", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_2/beta", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_2/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_6/tpu_batch_normalization_2/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/conv2d/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization/gamma", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization/beta", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_1/beta", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/conv2d_1/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_2/gamma", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_2/beta", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_2/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_7/tpu_batch_normalization_2/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/conv2d/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization/gamma", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization/beta", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 480, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_1/beta", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/conv2d_1/kernel", "shape": [1, 1, 480, 112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_8/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_1/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/conv2d_1/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_9/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_1/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/conv2d_1/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_10/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_1/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/conv2d_1/kernel", "shape": [1, 1, 672, 192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_11/tpu_batch_normalization_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/conv2d_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_12/tpu_batch_normalization_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/conv2d_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_13/tpu_batch_normalization_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/conv2d_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_14/tpu_batch_normalization_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1152, 1], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/conv2d_1/kernel", "shape": [1, 1, 1152, 320], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_2/gamma", "shape": [320], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_2/beta", "shape": [320], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_2/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "efficientnet-lite0/blocks_15/tpu_batch_normalization_2/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "efficientnet-lite0/head/conv2d/kernel", "shape": [1, 1, 320, 1280], "dtype": "float32"}, {"name": "efficientnet-lite0/head/tpu_batch_normalization/gamma", "shape": [1280], "dtype": "float32"}, {"name": "efficientnet-lite0/head/tpu_batch_normalization/beta", "shape": [1280], "dtype": "float32"}, {"name": "efficientnet-lite0/head/tpu_batch_normalization/moving_mean", "shape": [1280], "dtype": "float32"}, {"name": "efficientnet-lite0/head/tpu_batch_normalization/moving_variance", "shape": [1280], "dtype": "float32"}]}]}